---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Velocity
source: html/388a6784-7351-d0a7-3603-a6b85bf47548.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Velocity Property

The calculated velocity of this segment, in ft/s.

## Syntax (C#)
```csharp
public double Velocity { get; }
```